app/controllers/api/v1/products_controller.rb

SELECT `products`.* FROM `products` WHERE (title = 'Arugula' )
---
      def index
        products= Product.order('title ASC');

SELECT `products`.* FROM `products` WHERE (title = 'Arugula' )
SELECT  1 AS one FROM `products` WHERE (title = 'Arugula' ) LIMIT 1
---
      def show
        product = Product.where('title = ? ' , params[:id])
        if product.empty?

SELECT `products`.* FROM `products` WHERE (title = 'Arugula' )
---
      def avail
       products = Product.where('inventory_count > 0')

SELECT `products`.* FROM `products` WHERE (title = 'Arugula' )
SELECT  inventory_count AS count FROM `products` WHERE (title = 'Arugula' ) ORDER BY `products`.`id` ASC LIMIT 1
SELECT COUNT(inventory_count AS count) FROM `products` WHERE (title = 'Arugula' )
UPDATE `products` SET `inventory_count` = 6, `updated_at` = '2019-01-18 16:17:00' WHERE `products`.`id` = 14
---
      def purchase
         product = Product.where('title = ? ' , params[:id])
         if product.empty?
           render json: {status: 'Fail', message:' Could not Find Product!'},status: :ok;
         else
           @curr= product.select('inventory_count AS count').first.count
         if @curr > 0
           product.update(inventory_count: @curr-1)

SELECT `products`.* FROM `products` WHERE (title = 'purchase' )
UPDATE `products` SET `inventory_count` = 3, `updated_at` = '2019-01-18 01:24:17' WHERE `products`.`id` = 9
---
      def update
        product = Product.where('title = ? ' , params[:id])
        if product.update(product_params)